app/controllers/tweets_controller.rb

  def create
    Tweet.create(tweet_params)
---
INSERT INTO `tweets` (`text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('<script>alert(\"不正なスクリプトです\")</script>', 'ii', '2020-08-20 05:40:20.856241', '2020-08-20 05:40:20.856241', 1)

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 1

  def update
    tweet = Tweet.find(params[:id])
    tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1
UPDATE `tweets` SET `tweets`.`text` = 'Uryyyyyyyy!!!!!!', `tweets`.`updated_at` = '2020-08-07 11:06:08.516158' WHERE `tweets`.`id` = 9

  def show
    @comment = Comment.new
    @comments = @tweet.comments.includes(:user)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 3

  def set_tweet
    @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = NULL LIMIT 1